import { cropCanvas } from './canvas-utils';
import { compact } from 'lodash';
import { ExtCanvas } from './types';

export const CHINESE = [
	'一丁七万丈三上下不与丐丑专且丕世丘丙业丛东丝丞両丢两严並丧个丫中',
	'丰串临丸丹为主丼丽举乃久么义之乌乍乎乏乐乒乓乔乖乗乘乙九乞也习乡',
	'书买乱乳乾亀了予争事二于亏云互五井亘亙亚些亜亞亟亡亢交亥亦产亨亩',
	'享京亭亮亲亵人亿什仁仅仆仇今介仍从仏仑仓仔仕他仗付仙代令以仪们仮',
	'仰仲件价任份仿企伊伍伎伏伐休众优伙会伝伞伟传伢伤伦伪伯估伴伶伸伺',
	'似伽佃但位低住佐佑体何余佚佛作佟你佣佩佬佯佳併佼使侃侄來侈例侍侏',
	'侑供依侠価侣侥侦侧侨侬侮侯侵侶便係促俄俊俏俐俗俘保俞俟俠信俣俨俩',
	'俭修俯俱俳俵俸俺俾倉個倍倏倒倔倖倘候倚借倡倣値倦倩倪倫倭倶倹债值',
	'倾假偉偌偎偏偕做停健偲側偵偶偷偽偿傀傅傍傑傘備傣储傩催傭傲傳債傷',
	'傻傾僅働像僑僕僚僞僧僭僵價僻儀億儉儒償儡優儲儿兀允元兄充兆先光克',
	'免兎児兑兒兔党兜兢入全八公六兮兰共关兴兵其具典兹养兼兽冀内円冈冉',
	'冊册再冒冕冗写军农冠冢冤冥冨冬冯冰冲决冴况冶冷冻净凄准凉凋凌凍减',
	'凑凛凜凝几凡凤処凧凪凭凯凰凱凳凶凸凹出击函凿刀刁刃分切刈刊刑划列',
	'刘则刚创初删判別刨利别刮到制刷券刹刺刻刽剂剃則削剌前剑剔剖剛剣剤',
	'剥剧剩剪副剰割創剿劇劈劉劍力劝办功加务劣动助努劫励劲劳労効劾势勁',
	'勃勅勇勉勋勒動勘務勝募勢勤勧勲勳勺勾勿匀匁匂包匆匈匕化北匙匠匡匣',
	'匪匮匹区医匾匿十千升午卉半华协卑卒卓協单卖南単博卜占卡卢卤卦卧卫',
	'卯印危即却卵卷卸卿厂厄厅历厉压厌厕厘厚原厢厥厦厨厩厮厳去县参又叉',
	'及友双反収发叔取受变叙叛叟叠叡叢口古句另叨叩只叫召叭叮可台叱史右',
	'叶号司叹叼叽吁吃各吆合吉吊同名后吏吐向吓吕吗君吝吞吟吠否吧吨吩含',
	'听吭吮启吱吴吵吸吹吻吼吾呀呂呃呆呈呉告呐呕呗员呛呜呟呢周呪呱味呵',
	'呸呻呼命咀咄咆咋和咎咏咐咒咔咕咖咙咚咦咧咨咪咬咯咱咲咳咸咽哀品哄',
	'哆哇哈哉响哎哑哒哗哝哟員哥哦哧哨哩哪哭哮哲哺哼哽唄唆唇唉唐唔唠唤',
	'唧唬售唯唱唷唾啃啄商啊問啓啡啤啥啦啧啪啬啸啼喀喂喃善喇喉喊喋喔喘',
	'喙喚喜喝喧喩喪喫喬單喰喳営喷喻喽嗅嗒嗓嗔嗖嗜嗟嗡嗣嗤嗦嗨嗯嗳嗽嘀',
	'嘆嘈嘉嘎嘗嘘嘛嘟嘩嘱嘲嘴嘶嘻嘿噂噌噎噗噛噜噢器噩噪噬噴噶嚇嚎嚏嚓',
	'嚣嚴嚷嚼囊囚四回因团団园困囱囲図围固国图圃圆圈國圏園圓團土圣圧在',
	'圭地圳场圾址坂均坊坍坎坏坐坑块坚坛坝坞坟坠坡坤坦坪坯坷垂垃垄型垒',
	'垢垣垦垫垮埃埋城埔埜域埠埴執培基埼堀堂堅堆堑堕堡堤堪堯堰報場堵堺',
	'塀塁塊塌塑塔塗塘塙塚塞塩填塾境墅墓増墙墜增墟墨墩墳墾壁壇壊壌壑壕',
	'壘壞壤士壬壮壯声壱売壳壶壷壽处备変复夏夕外多夜够夢大天太夫夭央失',
	'头夷夸夹夺奂奄奇奈奉奋奎奏契奔奕奖套奚奠奢奥奧奨奪奬奮女奴奶奸她',
	'好如妃妄妆妇妈妊妒妓妖妙妞妥妨妬妮妹妻妾姆姉姊始姐姑姓委姗姚姜姥',
	'姦姨姪姫姬姻姿威娃娅娇娓娘娜娟娠娥娩娯娱娴娶娼婆婉婚婢婦婪婴婵婶',
	'婷婿媒媚媛媲媳嫁嫂嫉嫌嫔嫖嫡嫣嫦嫩嬉嬢孃子孔孕字存孙孚孜孝孟季孤',
	'学孩孫孰孵孽宁它宅宇守安宋完宏宕宗官宙定宛宜宝实実宠审客宣室宥宦',
	'宪宫宮宰害宴宵家容宽宾宿寂寄寅密寇富寐寒寓寛寝寞察寡寢寥實寧寨審',
	'寮寰寵寸对寺寻导対寿封専射将將專尉尊尋導小少尔尖尘尚尝尤尧尬尭就',
	'尴尸尹尺尻尼尽尾尿局屁层居屈屉届屋屎屏屑展属屠屡層履屯山屹屿岁岂',
	'岐岑岔岗岚岛岡岩岬岭岳岸峙峠峡峦峨峭峯峰島峻峽崇崎崔崖崚崛崩崭崽',
	'嵋嵌嵐嵩嵯嶋嶺巅巌巍巖川州巡巢巣工左巧巨巩巫差己已巳巴巷巻巽巾币',
	'市布帅帆师希帐帕帖帘帚帛帜帝帥带帧師席帮帯帰帳帶帷常帽幅幌幔幕幡',
	'幢幣干平年并幸幹幻幼幽幾广庁広庄庆庇床序庐库应底店庙庚府庞废度座',
	'庫庭庵庶康庸廃廉廊廓廖廟廣廳延廷建廻廿开弁异弃弄弊式弐弓弔引弗弘',
	'弛弟张弥弦弧弩弯弱張強弹强弼弾彈彌归当录彗彙彝形彦彩彪彫彬彭彰影',
	'彷役彻彼往征径待很徊律後徐徒従得徘徙從徠御復循微徳徴德徹徽心必忆',
	'忌忍忏忒忖志忘忙応忠忡忧快忱念忽忿怀态怂怅怎怒怔怕怖怜思怠怡急怦',
	'性怨怪怯总恃恆恋恍恐恒恕恙恚恢恣恤恥恨恩恪恬恭息恰恳恵恶恺恻恼恿',
	'悄悉悌悍悔悖悚悟悠患悦您悩悪悬悯悲悴悸悻悼情惇惊惋惑惕惘惚惜惟惠',
	'惡惣惦惧惨惩惫惬惭惮惯惰想惴惶惹惺愁愈愉意愕愚愛感愣愤愧愫愼愿慄',
	'慈態慌慎慑慕慢慣慧慨慮慰慶慷憂憋憎憐憔憚憤憧憨憩憬憲憶憾懂懇懈應',
	'懊懐懒懦懲懵懷懸懿戈戊戌戍戎戏成我戒或战戚戟戦截戮戯戰戲戳戴户戸',
	'戻房所扁扇扈扉手才扎扑扒打扔払托扛扣执扩扫扬扭扮扯扰扱扳扶批扼找',
	'承技抄抉把抑抒抓投抖抗折抚抛抜択抡抢护报抨披抬抱抵抹押抽抿拂担拆',
	'拇拈拉拌拍拎拐拒拓拔拖拗拘拙拚招拜拝拟拠拡拢拣拥拦拧拨择括拭拯拱',
	'拳拴拶拷拼拽拾拿持挂指按挑挖挙挚挛挝挟挠挡挣挤挥挨挪挫振挺挽挿捂',
	'捅捆捉捍捎捏捐捕捗捜捞损捡换捣捧捨据捲捶捷捺捻掀掃授掉掌掏掐排掖',
	'掘掛掠採探掣接控推掩措掬掲掳掴掷掺掻揃揉揍描提插揖揚換握揣揩揪揭',
	'揮援揺揽搀搁搂搅損搏搐搓搔搖搜搞搬搭携搾摂摄摆摇摊摑摒摔摘摧摩摯',
	'摸摹摺撂撃撇撑撒撕撚撞撤撩撫撬播撮撰撲撵撸撼擁擂擅擊操擎擒擞擢擦',
	'擬攀攒攘攝攥攫支收攸改攻放政故效敌敍敏救敕敖敗教敛敝敞敢散敦敬数',
	'敲整敵敷文斉斋斌斎斐斑斓斗料斜斟斡斤斥斧斩斬断斯新方於施旁旅旋族',
	'旗无既日旦旧旨早旬旭旱时旷旺昂昆昇昊昌明昏易昔星映春昧昨昭是昴昼',
	'显時晃晄晋晌晏晒晓晕晖晚晝晟晤晦晨晩普景晰晴晶智晾暁暂暄暇暉暑暖',
	'暗暢暦暧暨暫暮暴曇曉曖曙曜曝曦曰曲曳更書曹曼曽曾替最月有朋服朔朕',
	'朗望朝期朦木未末本札术朱朴朵机朽杀杂权杆杉李杏材村杖杜杞束杠条来',
	'杨杭杯杰東杵杷松板极构枇枉析枕林枚果枝枠枢枣枪枫枭枯架枷柄柊柏某',
	'柑染柔柘柚柜查柬柯柱柳柴柵査柾柿栃栄栅标栈栋栏树栓栖栗栞校栩株样',
	'核根格栽桁桂桃桅框案桌桐桑桓桔桜桟桢档桥桦桧桨桩桶梁梅梓梗梛條梢',
	'梦梧梨梭梯械梳梵梶检棄棉棋棍棒棕棘棚棟棠森棱棲棵棺椀椅椋植椎椒椛',
	'検椭椰椿楊楓楔楕楚楞楠楢業楯極楷楼楽概榄榆榈榊榎榛榜榨榮榴榻槇構',
	'槌槍槐様槙槛槻槽樂樊樋標樟模樣権横樫樱樵樹樺樽橄橋橘橙機橡橱檀檎',
	'檐檜檢檬櫂櫓櫛櫻欄欠次欢欣欤欧欲欺欽款歇歉歌歎歓止正此步武歧歩歪',
	'歯歳歴歹死歼殃殆殉殊残殖殡殴段殷殺殻殿毁毅毋母毎每毒毓比毕毗毘毙',
	'毛毡毫毬毯氏民氓气氖気氛氟氢氣氦氧氨氮氯水氷永氾汀汁求汇汉汎汐汕',
	'汗汚汛汝汞江池污汤汪汰汲汶汹決汽汾沁沂沃沈沉沌沐沓沖沙沛沟没沢沥',
	'沦沧沪沫沮河沸油治沼沽沾沿況泄泉泊泌法泛泞泡波泣泥注泪泰泳泵泻泼',
	'泽洁洋洒洗洛洞津洪洲洵洸活洼洽派流浄浅浆浇浊测济浏浑浒浓浙浚浜浦',
	'浩浪浬浮浴海浸涂涅消涉涌涎涕涙涛涟涡涣涤润涧涨涩涯液涵涸涼淀淄淆',
	'淋淌淑淖淘淡淤淨淫淮深淳淵混淹添清渇済渉渊渋渍渎渐渓渔渗渚減渝渠',
	'渡渣渤渥渦温測渭港渲渴游渺湃湄湊湍湖湘湛湧湯湾湿満溃溅溉源準溜溝',
	'溢溥溪溯溶溺滅滇滉滋滑滔滕滚滝滞满滤滥滨滩滯滴漁漂漆漉漏漓演漕漠',
	'漢漣漩漪漫漬漱漳漸漾潇潔潘潜潟潤潦潭潮潰澁澄澈澎澜澡澪澱澳激濁濃',
	'濒濕濠濡濫濯瀑瀕瀚瀛瀧瀬灌灘火灭灯灰灵灶灸灼災灾灿炉炊炎炒炕炖炙',
	'炫炬炭炮炯炳炸点為炼炽烁烂烈烏烘烙烛烟烤烦烧烫烬热烹烽焉焕焘焙焚',
	'無焦焰然焼煉煌煎煙煜煞煤照煩煮煽熄熊熏熔熙熟熬熱熹燃燈燎燒燕燥燦',
	'燭燿爆爪爬爭爱爲爵父爷爸爹爽爾片版牌牒牙牛牟牡牢牧物牲牵特牺牽犀',
	'犁犊犠犬犯状犹狂狄狈狐狒狗狙狞狠狡狩独狭狮狱狸狹狼猎猓猖猛猜猝猟',
	'猩猪猫献猴猶猾猿獄獅獗獣獲獸玄率玉王玑玖玛玩玫环现玲玺玻珀珂珈珊',
	'珍珑珠珥班現球琅理琉琏琐琛琢琥琦琪琳琴琵琶琼瑕瑙瑚瑛瑜瑞瑟瑠瑰瑳',
	'瑶瑾璃璇璋璐璞璧環璽瓜瓢瓣瓦瓮瓶瓷甄甘甚甜生産甥用甩甫甭田由甲申',
	'电男甸町画畅界畏畑畔留畜畝畠畢略番異畳畴畸畿疆疊疋疎疏疑疗疙疚疡',
	'疣疤疫疮疯疲疵疹疼疾病症痉痊痒痔痕痘痛痢痩痪痰痴痹瘍瘟瘢瘤瘦瘩瘪',
	'瘫瘸瘾療癌癒癖癫発登白百皂的皆皇皈皋皐皑皓皖皮皱皿盃盅盆盈益盎盏',
	'盐监盒盔盖盗盘盛盜盟盡監盤目盯盲直相盼盾省眈眉看県眞真眠眨眩眯眶',
	'眷眸眺眼着睁睐睑睛睡督睦睨睫睬睹睽睾睿瞄瞅瞎瞒瞟瞥瞧瞩瞪瞬瞭瞰瞳',
	'瞻瞿矗矛矜矢矣知矩矫短矮矯石矶矿码砂砌砍研砕砖砥砦砧砰砲破砸砾础',
	'硅硕硝硫硬确硯碁碉碌碍碎碑碓碗碘碟碧碩碰碱碳確碾磁磅磊磋磐磕磨磯',
	'磷磺礁礎示礼社祀祁祇祈祉祐祕祖祝神祟祠祢祥票祭祯祷祸祺祿禀禁禄禅',
	'禍禎福禧禪禮禰禱禹禺离禽禾秀私秃秉秋种科秒秘租秤秦秧秩积称秸移秽',
	'稀程稍税稔稚稜稟稠稣種稲稳稷稻稼稽稿穀穂穆積穏穗穣穫穰穴究穷穹空',
	'穿突窃窄窍窑窒窓窖窗窘窜窝窟窥窦窪窮窯窺窿立竖站竜竞竟章竣童竪竭',
	'端競竹竺竿笃笆笈笋笑笔笙笛笠符笨第笹笺笼筆筈等筋筏筐筑筒答策筛筝',
	'筵筷筹签简箇箋箍箔箕算管箫箭箱箸節範篇築篠篡篤篮篱篷簇簌簡簧簸簾',
	'簿籍籠米类籽籾粉粋粒粗粘粛粟粤粥粧粪粮粱粹精糊糕糖糙糜糟糧糸系糾',
	'紀約紅紊紋納紐純紗紘紙級紛素紡索紧紫紬累細紳紹紺終絃組絆経結絞絡',
	'絢給絮統絵絶絹継続綜維綱網綴綸綺綻綾綿緊緋総緑緒線締編緩緯練緻縁',
	'縄縛縞縣縦縫縮縱績繁繊繍織繕繡繫繭繰纂纏纖纠红纤约级纪纬纯纱纲纳',
	'纵纶纷纸纹纺纽线练组绅细织终绊绍绎经绑绒结绕绘给绚绛络绝绞统绢绣',
	'绥继绩绪绫续绮绯绰绳维绵绷绸综绽绿缀缄缅缆缉缎缓缔缕编缘缚缝缠缤',
	'缩缪缭缮缰缴缶缸缺罐网罕罗罚罡罢罩罪置罰署罵罷羁羅羊羌美羔羚羞羡',
	'群羨義羲羹羽翁翅翌翎習翔翘翟翠翩翰翻翼耀老考者耆而耍耐耕耗耳耶耸',
	'耻耽耿聂聆聊聋职联聖聘聚聞聡聪聴職聽聿肃肆肇肉肋肌肖肘肚肛肝肠股',
	'肢肤肥肩肪肮肯育肴肺肾肿胀胁胃胆背胎胖胚胜胞胡胤胥胧胰胱胳胴胶胸',
	'胺能脂脅脆脇脈脉脊脏脐脑脓脖脚脩脯脱脳脸脹脾腊腋腎腐腑腓腔腕腥腫',
	'腮腰腸腹腺腻腾腿膀膊膏膚膛膜膝膨膳膺臀臂臆臓臟臣臥臨自臭至致臻臼',
	'舅舆與興舌舍舎舒舔舗舜舞舟航般舰舱舵舶舷船艇艘艦良艰色艳艶艺艾节',
	'芋芒芙芜芝芥芦芬芭芯花芳芸芹芽苇苍苏苑苔苗苛苞苟若苦苯英苹苺茂范',
	'茄茅茉茎茜茧茨茫茬茵茶茸茹荀荃荆草荐荒荔荘荡荣荧荫药荷荻荼莉莊莎',
	'莞莫莱莲获莹莺莽菁菅菇菊菌菓菖菜菩菫華菱菲萃萄萊萌萍萎萝萠萤营萦',
	'萧萨萩萬萱落葆葉著葛葡董葦葫葬葱葵葺蒂蒋蒐蒔蒙蒜蒲蒸蒼蓄蓉蓋蓑蓓',
	'蓝蓦蓬蓮蔑蔓蔗蔚蔡蔣蔦蔬蔭蔵蔷蔼蔽蕃蕉蕊蕎蕗蕨蕪蕴蕾薄薇薗薙薛薦',
	'薩薪薫薬薯藁藉藍藏藐藕藝藤藥藩藻蘇蘑蘭蘸虎虏虐虑虔虚虜虞虫虹虻虽',
	'虾蚀蚁蚂蚊蚌蚕蛀蛇蛊蛋蛍蛙蛛蛟蛤蛮蛹蛾蜀蜂蜈蜒蜕蜗蜘蜜蜡蜷蜿蝇蝉',
	'蝎蝗蝙蝠蝦蝴蝶螂螃螅融螺蟀蟆蟋蟒蟹蟾蠕蠟蠢血衅衆行衍術衔街衙衛衝',
	'衞衡衣补表衫衬衰衷衿袁袄袅袈袋袍袒袖袜被袭袱袴裁裂装裏裔裕裘裙補',
	'裝裟裡裤裳裴裸裹製裾褂複褐褒褚褥褪褶襄襖襟襲西要覆覇見規視覗覚覧',
	'親観覽见观规觅视览觉觑角解触言訂訃計訊討訓託記訟訣訪設許訳訴診註',
	'証詐詔評詞詠詢詣試詩詫詮詰話該詳詹誇誉誌認誓誕誘語誠誤説読誰課誼',
	'調諄談請諏諒論諜諦諧諭諮諸諺諾謀謁謂謄謎謙講謝謠謡謹識譜警譬議譲',
	'護讃讐讓计订认讥讨让讪训议讯记讲讳讶讷许讹论讼讽设访诀证诃评诅识',
	'诈诉诊词诏译试诗诘诙诚诛话诞诠诡询诣该详诧诩诫诬语误诰诱诲说诵请',
	'诸诺读诽课谀谁调谅谈谊谋谍谎谏谐谑谒谓谕谙谚谛谜谟谢谣谤谦谨谩谬',
	'谭谱谴谷豁豆豊豚象豢豪豫豹貌貝貞負財貢貧貨販貪貫責貯貰貴買貸費貼',
	'貿賀賃賄資賊賑賓賛賜賞賠賢賣賦質賭購贈贝贞负贡财责贤败账货质贩贪',
	'贫贬购贮贯贰贱贴贵贷贸费贺贻贼贾贿赁赂赃资赋赌赎赏赐赓赔赖赘赚赛',
	'赞赠赡赢赣赤赦赫走赳赴赵赶起趁超越趋趟趣足趴趾跃跄跋跌跑跚跛距跟',
	'跡跤跨跪路跳践跷跺踉踊踌踏踝踞踢踩踪踱踵蹂蹄蹈蹊蹋蹑蹙蹟蹦蹬蹭蹲',
	'蹴蹿躁躇躍躏身躬躯躲躺車軌軍軒軟転軸軽較載輔輝輩輪輯輸輿轄轉轍轟',
	'车轧轨轩转轮软轰轲轴轻轼载轿较辄辅辆辈辉辐辑输辕辖辗辘辙辛辜辞辟',
	'辣辨辩辫辰辱農边辺辻込辽达辿迁迂迄迅过迈迎运近返还这进远违连迟迢',
	'迥迦迪迫迭述迷迸迹追退送适逃逆选逊逍透逐递逓途逗這通逛逝逞速造逢',
	'連逮週進逵逸逻逼逾遁遂遅遇遊運遍過遏遐道達違遗遙遜遠遡遣遥適遭遮',
	'遵遷選遺遼遽避邀邃還邑邓邢那邦邪邮邯邱邵邸邹邻郁郊郎郑郝郡部郭郵',
	'郷都鄂鄙鄭酉酋酌配酎酒酔酝酢酣酥酪酬酮酱酵酶酷酸酿醇醉醋醍醐醒醜',
	'醤醬醸釀采釈釉释里重野量金釘釜針釣釧鈍鈴鉄鉛鉢鉱鉴銀銃銅銑銘銚銭',
	'鋒鋭鋳鋸鋼錆錐錘錠錦錫錬錯録鍋鍛鍬鍵鎌鎖鎧鎭鎮鏡鐘鑄鑑鑫针钉钊钓',
	'钗钙钝钞钟钠钡钢钥钦钧钩钮钱钳钵钻钾铀铁铃铅铎铐铜铝铢铭铮铲银铸',
	'铺链销锁锄锅锈锋锌锐错锚锡锢锣锤锥锦键锯锵锻镀镇镑镖镜镯镰镶長长',
	'門閃閉開閏閑間関閣閤閥閲闇闘门闪闭问闯闲间闵闷闸闹闺闻闽阀阁阅阉',
	'阎阐阑阔阙阜队阪阮阱防阳阴阵阶阻阿陀附际陆陇陈陋陌降限陕陛陡院陣',
	'除陥陨险陪陰陳陵陶陷陸険陽隅隆隈隊隋階随隐隔隘隙際障隠隣隧險隶隷',
	'隻隼难雀雁雄雅集雇雌雍雏雑雕雛雜離難雨雪雫雯雰雲雳零雷電雾需霄霆',
	'震霉霊霍霎霓霖霜霞霧露霸霹青靖静靜非靠靡面革靳靴靶鞄鞅鞋鞍鞘鞠鞭',
	'韓韦韧韩韬音韵韶韻響頁頂頃項順須頌預頑頒頓頗領頬頭頰頻頼題額顎顔',
	'顕願顛類顧顯页顶顷项顺须顼顽顾顿颁颂预颅领颇颈颉颊颌颍颐频颓颖颗',
	'题颚颜额颠颤風颯风飘飛飜飞食飢飯飲飼飽飾餅養餌餐餓館饗饥饬饭饮饰',
	'饱饲饵饶饷饺饼饿馅馆馈馋馒首香馨馬馳馴駄駅駆駈駐駒駕駿騎騒験騰騷',
	'驍驗驚马驭驮驯驰驱驳驴驶驹驻驼驾驿骂骄骆骇验骏骑骗骚骡骤骥骨骷骸',
	'骼髄髅髓高髦髪髭髮鬓鬱鬼魁魂魄魅魏魔魚魯鮎鮮鯉鯛鯨鰯鱈鱒鱗鱼鲁鲍',
	'鲜鲤鲨鲸鳃鳄鳌鳍鳖鳞鳥鳩鳳鳴鳶鴨鴻鵜鵬鶏鶴鷄鷗鷲鷹鷺鸟鸠鸡鸣鸥鸦',
	'鸭鸯鸳鸽鸾鸿鹃鹅鹉鹊鹏鹤鹦鹰鹳鹿麒麓麗麟麦麹麺麻麽麿黄黎黏黑黒黔',
	'默黙黛黝黯鼎鼓鼠鼻鼾齊齐齢齿龄龈龋龍龙龚龟           ',
].map(lengthChecker(32)).join('');

export const BASE_CHARS = [
	' ☺☻♥♦♣♠•◘○◙♂♀♪♫☼►◄↕‼¶§▬↨↑↓→←∟↔▲▼',
	` !"#$%&'()*+,-./0123456789:;<=>?`,
	'@ABCDEFGHIJKLMNOPQRSTUVWXYZ[\\]^_',
	'`abcdefghijklmnopqrstuvwxyz{|}~⌂',
].map(lengthChecker(32)).join('');

export const CHARS = [
	' ☺☻♥♦♣♠•◘○◙♂♀♪♫☼►◄↕‼¶§▬↨↑↓→←∟↔▲▼',
	` !"#$%&'()*+,-./0123456789:;<=>?`,
	'@ABCDEFGHIJKLMNOPQRSTUVWXYZ[\\]^_',
	'`abcdefghijklmnopqrstuvwxyz{|}~⌂',
	'ÇüéâäàåçêëèïîìÄÅÉæÆôöòûùÿÖÜø£Ø×ƒ',
	'áíóúñÑªº¿®¬½¼¡«»АаБбВвГгДдЕеЁёЖж',
	'ЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦц',
	'ЧчШшЩщЪъЫыЬьЭэЮюЯяĄąĆćĘęŃńŚśŹźŻż',
	'ŁłÓÔŪū€·´°⚲⚥♡ß™ÁÃãÕõČčĎďĚěÍÚŇňŘř',
	'ŠšŤťŮůÝýŽžĹĺĽľŔŕĞğİıŞşÀÈÌÒÙЀЁЂЃЄ',
	'ЅІЇЈЉЊЋЌЍЎЏѐёђѓєѕіїјљњћќѝўџѠѡѢѣѤ',
	'ѥѰѱѲѳҊҋҌҍҎҏҐґ ĂăÂÎȘșȚțŊŋŐőŰűĀāĈĉ',
	'■□▢▣▤▥▦▧▨▩▪▫▭▮▯▰▱△▴▵▶▷▸▹▻▽▾▿◀◁◂◃',
	'◅◆◇◈◉◊◌◍◎●◐◑◒◓◔◕◖◗◚◛◜◝◞◟◠◡◢◣◤◥◦◧',
	'◨◩◪◫◬◭◮◯◰◱◲◳◴◵◶◷◸◹◺◻◼◽◾◿¸¾ÊËÏÐÛÞ',
	'ΑΒΓΔΕΖΗΘΙΚΛΜΝΞΟΠΡΣΤΥΦΧΨΩĊċĐđĒēĚě',
	'αβγδεζηθικλμνξοπρστυφχψωĖėĜĝĠġĢģ',
	'ĤĥĦħĨĩĪīĬĭĮįĲĳĴĵĶķĸĻļĿŀŅņŉŌōŎŏŒœ',
	'ŖŗŜŝŢţŦŧŨũŬŭŲųŴŵŶŷŸſ¢¤¥¦¨©¯±¹²³µ',
	'ð÷þĔĕ★☆✰✦✧卐卍❥ღஐϟ【】《》✿❀№♢♤♧✓✔✕✖✗✘',
	'ぁあぃいぅうぇえぉおかがきぎくぐけげこごさざしじすずせぜそぞただ',
	'ちぢっつづてでとどなにぬねのはばぱひびぴふぶぷへべぺほぼぽまみむ',
	'めもゃやゅゆょよらりるれろゎわゐゑをんゔゕゖ｟｠｡｢｣､･￣ˊς',
	'ァアィイゥウェエォオカガキギクグケゲコゴサザシジスズセゼソゾタダ',
	'チヂッツヅテデトドナニヌネノハバパヒビピフブプヘベペホボポマミム',
	'メモャヤュユョヨラリルレロヮワヰヱヲンヴヵヶヷヸヹヺ・ーヽヾヿ ',
	'、。〃々〈〉「」『』〒〓〜〝〞〟〡〢〣〤〦〧〨〩〰〱〲〳〴〵  ',
	'‐‑‒–—―‖‗‘’‚‛“”„‟‧⁇⁈⁉            ',
	'⚧☿♁⚨⚩⚦⚢⚣⚤♔♕♚♛❣☀…                ',
	'👃🙂😵😠😐😑😆😟🙃                       ',
	'                                ',
	'                                ',
].map(lengthChecker(32)).join('');

export const ROMAJI = [
	'\uff00！＂＃＄％＆＇（）＊＋，－．／０１２３４５６７８９：；＜＝＞？',
	'＠ＡＢＣＤＥＦＧＨＩＪＫＬＭＮＯＰＱＲＳＴＵＶＷＸＹＺ［＼］＾＿',
	'｀ａｂｃｄｅｆｇｈｉｊｋｌｍｎｏｐｑｒｓｔｕｖｗｘｙｚ｛｜｝～ ',
].map(lengthChecker(32)).join('');

export const EMOJI = [
	'😍😈👿🤔            ',
	'❤💙💚💛💜🖤💔💖💗💕      ',
	'🦋🕷🦇👻🐾🐈🐱😺😸😹😻😼😽🙀😿😾',
	'🌸💮🌲🎄💐🌿🍎🍏🍊🏀🎃🍕🍬🍭🍡🌈',
	'💎🥌🎁⛄❄🕯🎅🌠⭐🌟🎲✨⚡🔥🎵🎶',
	'♈♉♊♋♌♍♎♏♐♑♒♓⛎👑☘🍀',
	'🍪🥚🍐🥭🥕🍇⛏🍌        ',
].map(lengthChecker(16)).join('');

function isSurrogate(code: number) {
	return code >= 0xd800 && code <= 0xdbff;
}

function fromSurrogate(high: number, low: number) {
	return ((high & 0x3ff) << 10) + (low & 0x3ff) + 0x10000;
}

export function charsToCodes(text: string) {
	const chars: number[] = [];

	for (let i = 0; i < text.length; i++) {
		let code = text.charCodeAt(i);

		if (isSurrogate(code) && (i + 1) < text.length) {
			code = fromSurrogate(code, text.charCodeAt(i + 1));
			i++;
		}

		chars.push(code);
	}

	return chars;
}

export interface FontSprite {
	code: number;
	sprite: number;
}

export function createFont(
	canvas: ExtCanvas, w: number, h: number, addImage: (canvas: ExtCanvas) => number,
	options: { noChinese?: boolean; mono?: number; onlyBase?: boolean; } = {},
): FontSprite[] {
	const data = canvas.getContext('2d')!.getImageData(0, 0, canvas.width, canvas.height);
	const cols = canvas.width / w;
	const baseCodes = charsToCodes(BASE_CHARS);
	const charsCodes = charsToCodes(CHARS);
	const chineseCodes = options.noChinese ? [] : charsToCodes(CHINESE);
	const romajiCodes = charsToCodes(ROMAJI);
	const codes = options.onlyBase ? [...baseCodes] : [...charsCodes, ...chineseCodes, ...romajiCodes];
	const baseCodesLength = charsCodes.length + chineseCodes.length;
	const added = new Set<number>();
	const arrows = new Set('↑↓'.split('').map(x => x.charCodeAt(0)));

	return compact(codes
		.map((code, i) => {
			if (i >= baseCodesLength) {
				i = 32 + (i - baseCodesLength);
			}

			const { x, y } = getXY(cols, i);
			let { left, width } = getCharWidth(data, x, y, w, h);
			const actualCode = i ? code : 0;

			if (arrows.has(code)) {
				left -= 1;
				width += 2;
			}

			if (width !== 0 && options.mono !== undefined) {
				left = 0;
				width = options.mono;
			}

			if (!width) {
				return undefined;
			} else if (added.has(actualCode)) {
				// console.log('skipping character', actualCode);
				return undefined;
			} else {
				const sprite = addImage(cropCanvas(canvas, x * w + left, y * h, width - left, h));
				added.add(actualCode);
				return { code: actualCode, sprite };
			}
		}))
		.sort(compareFontSprite);
}

export function createEmojis(
	canvas: ExtCanvas, w: number, h: number, addImage: (canvas: ExtCanvas) => number
): FontSprite[] {
	const data = canvas.getContext('2d')!.getImageData(0, 0, canvas.width, canvas.height);
	const cols = canvas.width / w;

	return compact(charsToCodes(EMOJI)
		.map((code, i) => {
			const { x, y } = getXY(cols, i);
			const { left, width } = getCharWidth(data, x, y, w, h);

			if (!code || code === 32) {
				return undefined;
			}

			if (!width) {
				console.log('emoji not found in PSD', code, width);
				return undefined;
			}

			const sprite = addImage(cropCanvas(canvas, x * w + left, y * h, width - left, h));
			return { code, sprite };
		}))
		.sort(compareFontSprite);
}

export function fontSpritesToStringAndSprites(fontSprites: FontSprite[]): { chars: string; sprites: number[]; } {
	const chars = fontSprites.map(s => String.fromCodePoint(s.code)).join('');
	const sprites = fontSprites.map(s => s.sprite);
	return { chars, sprites };
}

function compareFontSprite(a: FontSprite, b: FontSprite) {
	return a.code - b.code;
}

function isColEmpty(data: ImageData, x: number, y: number, h: number) {
	for (let yy = 0; yy < h; yy++) {
		if (data.data[((y + yy) * data.width + x) * 4 + 3])
			return false;
	}

	return true;
}

function getXY(cols: number, i: number) {
	return { x: i % cols, y: Math.floor(i / cols) };
}

function getCharWidth(data: ImageData, x: number, y: number, w: number, h: number) {
	let left = 0;
	let width = w;

	for (; left < w; left++) {
		if (!isColEmpty(data, x * w + left, y * h, h)) {
			break;
		}
	}

	for (; width > 0; width--) {
		if (!isColEmpty(data, x * w + width - 1, y * h, h)) {
			break;
		}
	}

	return { left, width };
}

function lengthChecker(expected: number) {
	return function (line: string) {
		const length = charsToCodes(line).length;

		if (length !== expected)
			throw new Error(`Invalid line length (${length}/${expected}) in "${line}"`);

		return line;
	};
}
